examples/21-influxdb-realtime.yaml
# Real-time InfluxDB Reporting Example

This example demonstrates how to monitor a load test in real-time by shipping metrics to InfluxDB.

```yaml
execution:
  - concurrency: 50
    ramp-up: 30s
    hold-for: 5m
    scenario: stress_test

scenarios:
  stress_test:
    requests:
      - https://api.example.com/v1/status

reporting:
  - module: influxdb
    url: http://localhost:8086
    bucket: load_test_bucket
    token: ${env.INFLUX_TOKEN}
    org: my_org
    interval: 5s  # push live metrics every 5 seconds
```

## Benefits of Real-time Reporting

1.  **Live Dashboards**: Use Grafana to visualize the load test as it happens.
2.  **Early Detection**: Spot memory leaks or performance degradation before the test completes.
3.  **Distributed Sync**: Each worker node automatically includes its `worker_id` for correct aggregation.